Revit 2027 API
BuiltInFailures.RoomFailures.RoomTagBadViewType Property
 [Room] Tags can only be placed in Floor Plan, Reflected Ceiling Plan and Section Views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomTagBadViewType { get; }
Public Shared ReadOnly Property RoomTagBadViewType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomTagBadViewType {
	FailureDefinitionId^ get ();
}
static member RoomTagBadViewType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace